rammp-org/pace-racer-fw/components/pace-racer-board/current-control/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_MCPWM_ISR_IRAM_SAFE=y
CONFIG_MCPWM_CTRL_FUNC_IN_IRAM=y

# Make the native USB (USB-Serial-JTAG) port the primary console so it is
# bidirectional: the TUI can write on/off commands to firmware stdin, not just
# read output. Default config binds stdin to UART0, which isn't on the USB port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
